menulist = {1:300}
sum = 0

while True :
    print("*******************************************************************************")
    print("메뉴 (0.주문종료 1:연필(300원) 2:지우개(100원) 3:커피(500원) 4:탄산음료(700원))")
    print("*******************************************************************************")
    menu = int(input("메뉴를 입력하세요 : "))
    sum = sum + menulist[menu]
    if menu >=5 : print("번호를 잘못 입력하셨습니다. 다시 입력하세요.")
    if menu == 0 :
        print("총 결제금액은", sum ,"입니다." )
        break
        
